app/controllers/nokta_controller.rb

  def create
    @noktum = current_user.nokta.build(noktum_params)
    respond_to do |format|
      if @noktum.save
---
INSERT INTO "nokta" ("body", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["body", "hhhhh8"], ["user_id", 1], ["created_at", "2018-08-04 19:55:12.930961"], ["updated_at", "2018-08-04 19:55:12.930961"]]