app/controllers/profile_controller.rb

  def list
    @user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def allusers
    @users = User.all
---
SELECT "users".* FROM "users"